#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.develop["01-Documentation"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "01-Documentation"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["communication-service"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "communication-service"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["general-docs"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "general-docs"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["to-do-api"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-api"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.develop["to-do-web"] will be created
  + resource "github_branch" "develop" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-web"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["01-Documentation"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "01-Documentation"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["communication-service"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "communication-service"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["general-docs"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "general-docs"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["to-do-api"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-api"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch.release["to-do-web"] will be created
  + resource "github_branch" "release" {
      + branch        = "release"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "to-do-web"
      + sha           = (known after apply)
      + source_branch = (known after apply)
      + source_sha    = (known after apply)
    }

  # github_branch_protection.main["01-Documentation"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["communication-service"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["general-docs"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["to-do-api"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["to-do-web"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_issue.initial_setup["Documentation"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "flovearth",
        ]
      + body       = <<-EOT
            ## Documentation Projesi Başlangıç Görevleri / Initial Setup Tasks
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Merhaba @flovearth,
            
            Documentation projesi başarıyla oluşturuldu! Bu görev, projenin hayata geçirilmesi için tamamlanması gereken ilk kritik adımları takip etmek amacıyla otomatik olarak açılmıştır.
            
            ### 🚀 Başlangıç Adımları:
            
            - [ ] **README dosyasını detaylandır:** Projenin amacını, hedeflerini ve temel mimarisini anlatan şekilde `README.md` dosyasını güncelle.
            - [ ] **Geliştirme ortamını dökümante et:** Projeyi bir geliştiricinin kendi bilgisayarında nasıl ayağa kaldıracağını anlatan adımları `CONTRIBUTING.md` veya `docs/DEVELOPMENT.md` dosyasına ekle.
            - [ ] **CI/CD pipeline'ını kur:** Proje için temel bir Sürekli Entegrasyon (CI) ve Sürekli Dağıtım (CD) pipeline'ı kur (Örn: GitHub Actions ile testlerin otomatik koşması).
            - [ ] **Issue şablonlarını oluştur:** Hata bildirimi (bug report) ve yeni özellik talebi (feature request) için `.github/ISSUE_TEMPLATE` klasörü altında standart şablonlar oluştur.
            - [ ] **İlk görevleri belirle:** Projenin ilk adımları için gerekli görevleri belirle, issue'ları oluştur ve proje panosuna (GitHub Projects) ekle.
            - [ ] **Katkıda bulunma kurallarını belirle:** Projeye nasıl katkı sağlanacağını anlatan `CONTRIBUTING.md` dosyasını oluştur veya detaylandır.
            
            ---
            
            **Proje Lideri:** @flovearth
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            Hello @flovearth,
            
            The Documentation project has been successfully created! This issue has been automatically opened to track the critical first steps required to get the project up and running.
            
            ### 🚀 Initial Setup Steps:
            
            - [ ] **Flesh out the README file:** Update the `README.md` file to describe the project's purpose, goals, and basic architecture.
            - [ ] **Document the development environment:** Add steps on how a developer can set up and run the project locally in a `CONTRIBUTING.md` or `docs/DEVELOPMENT.md` file.
            - [ ] **Set up the CI/CD pipeline:** Establish a basic Continuous Integration (CI) and Continuous Deployment (CD) pipeline for the project (e.g., running tests automatically with GitHub Actions).
            - [ ] **Create issue templates:** Create standard templates for bug reports and feature requests under the `.github/ISSUE_TEMPLATE` directory.
            - [ ] **Define initial tasks:** Identify the first set of tasks for the project, create issues for them, and add them to the project board (GitHub Projects).
            - [ ] **Define contribution guidelines:** Create or detail the `CONTRIBUTING.md` file, explaining how to contribute to the project.
            
            ---
            
            **Project Lead:** @flovearth
            
            </details>
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "01-Documentation"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-alpha"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "flovearth",
        ]
      + body       = <<-EOT
            ## project-alpha Projesi Başlangıç Görevleri / Initial Setup Tasks
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Merhaba @flovearth,
            
            project-alpha projesi başarıyla oluşturuldu! Bu görev, projenin hayata geçirilmesi için tamamlanması gereken ilk kritik adımları takip etmek amacıyla otomatik olarak açılmıştır.
            
            ### 🚀 Başlangıç Adımları:
            
            - [ ] **README dosyasını detaylandır:** Projenin amacını, hedeflerini ve temel mimarisini anlatan şekilde `README.md` dosyasını güncelle.
            - [ ] **Geliştirme ortamını dökümante et:** Projeyi bir geliştiricinin kendi bilgisayarında nasıl ayağa kaldıracağını anlatan adımları `CONTRIBUTING.md` veya `docs/DEVELOPMENT.md` dosyasına ekle.
            - [ ] **CI/CD pipeline'ını kur:** Proje için temel bir Sürekli Entegrasyon (CI) ve Sürekli Dağıtım (CD) pipeline'ı kur (Örn: GitHub Actions ile testlerin otomatik koşması).
            - [ ] **Issue şablonlarını oluştur:** Hata bildirimi (bug report) ve yeni özellik talebi (feature request) için `.github/ISSUE_TEMPLATE` klasörü altında standart şablonlar oluştur.
            - [ ] **İlk görevleri belirle:** Projenin ilk adımları için gerekli görevleri belirle, issue'ları oluştur ve proje panosuna (GitHub Projects) ekle.
            - [ ] **Katkıda bulunma kurallarını belirle:** Projeye nasıl katkı sağlanacağını anlatan `CONTRIBUTING.md` dosyasını oluştur veya detaylandır.
            
            ---
            
            **Proje Lideri:** @flovearth
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            Hello @flovearth,
            
            The project-alpha project has been successfully created! This issue has been automatically opened to track the critical first steps required to get the project up and running.
            
            ### 🚀 Initial Setup Steps:
            
            - [ ] **Flesh out the README file:** Update the `README.md` file to describe the project's purpose, goals, and basic architecture.
            - [ ] **Document the development environment:** Add steps on how a developer can set up and run the project locally in a `CONTRIBUTING.md` or `docs/DEVELOPMENT.md` file.
            - [ ] **Set up the CI/CD pipeline:** Establish a basic Continuous Integration (CI) and Continuous Deployment (CD) pipeline for the project (e.g., running tests automatically with GitHub Actions).
            - [ ] **Create issue templates:** Create standard templates for bug reports and feature requests under the `.github/ISSUE_TEMPLATE` directory.
            - [ ] **Define initial tasks:** Identify the first set of tasks for the project, create issues for them, and add them to the project board (GitHub Projects).
            - [ ] **Define contribution guidelines:** Create or detail the `CONTRIBUTING.md` file, explaining how to contribute to the project.
            
            ---
            
            **Project Lead:** @flovearth
            
            </details>
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "to-do-api"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-beta"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "ismailaricioglu",
        ]
      + body       = <<-EOT
            ## project-beta Projesi Başlangıç Görevleri / Initial Setup Tasks
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Merhaba @ismailaricioglu,
            
            project-beta projesi başarıyla oluşturuldu! Bu görev, projenin hayata geçirilmesi için tamamlanması gereken ilk kritik adımları takip etmek amacıyla otomatik olarak açılmıştır.
            
            ### 🚀 Başlangıç Adımları:
            
            - [ ] **README dosyasını detaylandır:** Projenin amacını, hedeflerini ve temel mimarisini anlatan şekilde `README.md` dosyasını güncelle.
            - [ ] **Geliştirme ortamını dökümante et:** Projeyi bir geliştiricinin kendi bilgisayarında nasıl ayağa kaldıracağını anlatan adımları `CONTRIBUTING.md` veya `docs/DEVELOPMENT.md` dosyasına ekle.
            - [ ] **CI/CD pipeline'ını kur:** Proje için temel bir Sürekli Entegrasyon (CI) ve Sürekli Dağıtım (CD) pipeline'ı kur (Örn: GitHub Actions ile testlerin otomatik koşması).
            - [ ] **Issue şablonlarını oluştur:** Hata bildirimi (bug report) ve yeni özellik talebi (feature request) için `.github/ISSUE_TEMPLATE` klasörü altında standart şablonlar oluştur.
            - [ ] **İlk görevleri belirle:** Projenin ilk adımları için gerekli görevleri belirle, issue'ları oluştur ve proje panosuna (GitHub Projects) ekle.
            - [ ] **Katkıda bulunma kurallarını belirle:** Projeye nasıl katkı sağlanacağını anlatan `CONTRIBUTING.md` dosyasını oluştur veya detaylandır.
            
            ---
            
            **Proje Lideri:** @ismailaricioglu
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            Hello @ismailaricioglu,
            
            The project-beta project has been successfully created! This issue has been automatically opened to track the critical first steps required to get the project up and running.
            
            ### 🚀 Initial Setup Steps:
            
            - [ ] **Flesh out the README file:** Update the `README.md` file to describe the project's purpose, goals, and basic architecture.
            - [ ] **Document the development environment:** Add steps on how a developer can set up and run the project locally in a `CONTRIBUTING.md` or `docs/DEVELOPMENT.md` file.
            - [ ] **Set up the CI/CD pipeline:** Establish a basic Continuous Integration (CI) and Continuous Deployment (CD) pipeline for the project (e.g., running tests automatically with GitHub Actions).
            - [ ] **Create issue templates:** Create standard templates for bug reports and feature requests under the `.github/ISSUE_TEMPLATE` directory.
            - [ ] **Define initial tasks:** Identify the first set of tasks for the project, create issues for them, and add them to the project board (GitHub Projects).
            - [ ] **Define contribution guidelines:** Create or detail the `CONTRIBUTING.md` file, explaining how to contribute to the project.
            
            ---
            
            **Project Lead:** @ismailaricioglu
            
            </details>
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "communication-service"
      + title      = "Initial Setup"
    }

  # github_issue.initial_setup["project-gamma"] will be created
  + resource "github_issue" "initial_setup" {
      + assignees  = [
          + "egeren",
        ]
      + body       = <<-EOT
            ## project-gamma Projesi Başlangıç Görevleri / Initial Setup Tasks
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Merhaba @egeren,
            
            project-gamma projesi başarıyla oluşturuldu! Bu görev, projenin hayata geçirilmesi için tamamlanması gereken ilk kritik adımları takip etmek amacıyla otomatik olarak açılmıştır.
            
            ### 🚀 Başlangıç Adımları:
            
            - [ ] **README dosyasını detaylandır:** Projenin amacını, hedeflerini ve temel mimarisini anlatan şekilde `README.md` dosyasını güncelle.
            - [ ] **Geliştirme ortamını dökümante et:** Projeyi bir geliştiricinin kendi bilgisayarında nasıl ayağa kaldıracağını anlatan adımları `CONTRIBUTING.md` veya `docs/DEVELOPMENT.md` dosyasına ekle.
            - [ ] **CI/CD pipeline'ını kur:** Proje için temel bir Sürekli Entegrasyon (CI) ve Sürekli Dağıtım (CD) pipeline'ı kur (Örn: GitHub Actions ile testlerin otomatik koşması).
            - [ ] **Issue şablonlarını oluştur:** Hata bildirimi (bug report) ve yeni özellik talebi (feature request) için `.github/ISSUE_TEMPLATE` klasörü altında standart şablonlar oluştur.
            - [ ] **İlk görevleri belirle:** Projenin ilk adımları için gerekli görevleri belirle, issue'ları oluştur ve proje panosuna (GitHub Projects) ekle.
            - [ ] **Katkıda bulunma kurallarını belirle:** Projeye nasıl katkı sağlanacağını anlatan `CONTRIBUTING.md` dosyasını oluştur veya detaylandır.
            
            ---
            
            **Proje Lideri:** @egeren
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            Hello @egeren,
            
            The project-gamma project has been successfully created! This issue has been automatically opened to track the critical first steps required to get the project up and running.
            
            ### 🚀 Initial Setup Steps:
            
            - [ ] **Flesh out the README file:** Update the `README.md` file to describe the project's purpose, goals, and basic architecture.
            - [ ] **Document the development environment:** Add steps on how a developer can set up and run the project locally in a `CONTRIBUTING.md` or `docs/DEVELOPMENT.md` file.
            - [ ] **Set up the CI/CD pipeline:** Establish a basic Continuous Integration (CI) and Continuous Deployment (CD) pipeline for the project (e.g., running tests automatically with GitHub Actions).
            - [ ] **Create issue templates:** Create standard templates for bug reports and feature requests under the `.github/ISSUE_TEMPLATE` directory.
            - [ ] **Define initial tasks:** Identify the first set of tasks for the project, create issues for them, and add them to the project board (GitHub Projects).
            - [ ] **Define contribution guidelines:** Create or detail the `CONTRIBUTING.md` file, explaining how to contribute to the project.
            
            ---
            
            **Project Lead:** @egeren
            
            </details>
        EOT
      + etag       = (known after apply)
      + id         = (known after apply)
      + issue_id   = (known after apply)
      + labels     = [
          + "priority:high",
          + "setup",
        ]
      + number     = (known after apply)
      + repository = "general-docs"
      + title      = "Initial Setup"
    }

  # github_issue_label.priority_high["01-Documentation"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "01-Documentation"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["communication-service"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "communication-service"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["general-docs"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "general-docs"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["to-do-api"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "to-do-api"
      + url         = (known after apply)
    }

  # github_issue_label.priority_high["to-do-web"] will be created
  + resource "github_issue_label" "priority_high" {
      + color       = "d93f0b"
      + description = "High priority tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "priority:high"
      + repository  = "to-do-web"
      + url         = (known after apply)
    }

  # github_issue_label.setup["01-Documentation"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "01-Documentation"
      + url         = (known after apply)
    }

  # github_issue_label.setup["communication-service"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "communication-service"
      + url         = (known after apply)
    }

  # github_issue_label.setup["general-docs"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "general-docs"
      + url         = (known after apply)
    }

  # github_issue_label.setup["to-do-api"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "to-do-api"
      + url         = (known after apply)
    }

  # github_issue_label.setup["to-do-web"] will be created
  + resource "github_issue_label" "setup" {
      + color       = "1d76db"
      + description = "Initial setup tasks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "setup"
      + repository  = "to-do-web"
      + url         = (known after apply)
    }

  # github_repository.repo["01-Documentation"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Topluluk için genel dokümantasyon"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "01-Documentation"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["communication-service"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Core service for Project Communication"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "communication-service"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["general-docs"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Documentation for Project General Docs"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "general-docs"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["to-do-api"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "API service for Project To-Do"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "to-do-api"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.repo["to-do-web"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Web interface for Project To-Do"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "to-do-web"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_collaborator.lead["01-Documentation"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "01-Documentation"
      + username                    = "flovearth"
    }

  # github_repository_collaborator.lead["communication-service"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "communication-service"
      + username                    = "ismailaricioglu"
    }

  # github_repository_collaborator.lead["general-docs"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "general-docs"
      + username                    = "egeren"
    }

  # github_repository_collaborator.lead["to-do-api"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "to-do-api"
      + username                    = "flovearth"
    }

  # github_repository_collaborator.lead["to-do-web"] will be created
  + resource "github_repository_collaborator" "lead" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "to-do-web"
      + username                    = "flovearth"
    }

  # github_repository_file.codeowners["01-Documentation"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["communication-service"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @ismailaricioglu
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["general-docs"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @egeren
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["to-do-api"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["to-do-web"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "Add CODEOWNERS file"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            * @flovearth
        EOT
      + file                         = ".github/CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["01-Documentation"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Documentation Projesi Tanıtım Belgesi
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu belge, bu reponun ait olduğu **Documentation** projesinin genel hedeflerini, kapsamını ve liderliğini tanımlar.
            
            ---
            
            ### 🎯 Projenin Amacı
            _(Lütfen bu bölümü, projenin çözdüğü temel sorunu veya ulaşmayı hedeflediği ana amacı bir-iki cümle ile doldurun.)_
            
            Örnek: "Bu proje, kullanıcılarımızın mobil cihazlar üzerinden sipariş verebilmesini sağlayan modern ve hızlı bir API servisi geliştirmeyi amaçlamaktadır."
            
            ### 🔑 Ana Hedefler
            *   _(Projenin başarılı sayılması için gereken ölçülebilir bir hedef, örn: Sipariş sürecini 3 saniyenin altına indirmek.)_
            *   _(Başka bir hedef, örn: %99.9 çalışma süresi (uptime) sağlamak.)_
            *   _(Başka bir hedef...)_
            
            ### scope Kapsam
            _(Projenin neleri içerdiğini ve neleri **içermediğini** burada belirtin.)_
            
            ### 👤 Proje Lideri
            Bu projenin teknik ve idari liderliğinden **@flovearth** sorumludur.
            
            ### 🔗 İlgili Bağlantılar
            *   **[Takım Bilgileri](TEAM.md):** Proje ekibi ve rolleri.
            *   **Proje Panosu:** _(Varsa GitHub Projects panosunun linkini buraya ekleyin)_
            
            ---
            <p align="right"><i>Bu belge Terraform tarafından otomatik olarak oluşturulmuştur.</i></p>
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            This document defines the overall goals, scope, and leadership for the **Documentation** project, to which this repository belongs.
            
            ---
            
            ### 🎯 Project Mission
            _(Please fill this section with one or two sentences describing the core problem this project solves or the main goal it aims to achieve.)_
            
            Example: "This project aims to develop a modern and fast API service that allows our users to place orders via their mobile devices."
            
            ### 🔑 Key Objectives
            *   _(A measurable goal for project success, e.g., Reduce the order processing time to under 3 seconds.)_
            *   _(Another objective, e.g., Achieve 99.9% uptime.)_
            *   _(Another objective...)_
            
            ### 🗺️ Scope
            _(Define what is included and what is **not** included in the project's scope here.)_
            
            ### 👤 Project Lead
            **@flovearth** is responsible for the technical and administrative leadership of this project.
            
            ### 🔗 Related Links
            *   **[Team Information](TEAM.md):** The project team and their roles.
            *   **Project Board:** _(Add the link to the GitHub Projects board here, if any)_
            
            ---
            <p align="right"><i>This document was automatically generated by Terraform.</i></p>
            
            </details>
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["communication-service"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-beta Projesi Tanıtım Belgesi
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu belge, bu reponun ait olduğu **project-beta** projesinin genel hedeflerini, kapsamını ve liderliğini tanımlar.
            
            ---
            
            ### 🎯 Projenin Amacı
            _(Lütfen bu bölümü, projenin çözdüğü temel sorunu veya ulaşmayı hedeflediği ana amacı bir-iki cümle ile doldurun.)_
            
            Örnek: "Bu proje, kullanıcılarımızın mobil cihazlar üzerinden sipariş verebilmesini sağlayan modern ve hızlı bir API servisi geliştirmeyi amaçlamaktadır."
            
            ### 🔑 Ana Hedefler
            *   _(Projenin başarılı sayılması için gereken ölçülebilir bir hedef, örn: Sipariş sürecini 3 saniyenin altına indirmek.)_
            *   _(Başka bir hedef, örn: %99.9 çalışma süresi (uptime) sağlamak.)_
            *   _(Başka bir hedef...)_
            
            ### scope Kapsam
            _(Projenin neleri içerdiğini ve neleri **içermediğini** burada belirtin.)_
            
            ### 👤 Proje Lideri
            Bu projenin teknik ve idari liderliğinden **@ismailaricioglu** sorumludur.
            
            ### 🔗 İlgili Bağlantılar
            *   **[Takım Bilgileri](TEAM.md):** Proje ekibi ve rolleri.
            *   **Proje Panosu:** _(Varsa GitHub Projects panosunun linkini buraya ekleyin)_
            
            ---
            <p align="right"><i>Bu belge Terraform tarafından otomatik olarak oluşturulmuştur.</i></p>
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            This document defines the overall goals, scope, and leadership for the **project-beta** project, to which this repository belongs.
            
            ---
            
            ### 🎯 Project Mission
            _(Please fill this section with one or two sentences describing the core problem this project solves or the main goal it aims to achieve.)_
            
            Example: "This project aims to develop a modern and fast API service that allows our users to place orders via their mobile devices."
            
            ### 🔑 Key Objectives
            *   _(A measurable goal for project success, e.g., Reduce the order processing time to under 3 seconds.)_
            *   _(Another objective, e.g., Achieve 99.9% uptime.)_
            *   _(Another objective...)_
            
            ### 🗺️ Scope
            _(Define what is included and what is **not** included in the project's scope here.)_
            
            ### 👤 Project Lead
            **@ismailaricioglu** is responsible for the technical and administrative leadership of this project.
            
            ### 🔗 Related Links
            *   **[Team Information](TEAM.md):** The project team and their roles.
            *   **Project Board:** _(Add the link to the GitHub Projects board here, if any)_
            
            ---
            <p align="right"><i>This document was automatically generated by Terraform.</i></p>
            
            </details>
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["general-docs"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-gamma Projesi Tanıtım Belgesi
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu belge, bu reponun ait olduğu **project-gamma** projesinin genel hedeflerini, kapsamını ve liderliğini tanımlar.
            
            ---
            
            ### 🎯 Projenin Amacı
            _(Lütfen bu bölümü, projenin çözdüğü temel sorunu veya ulaşmayı hedeflediği ana amacı bir-iki cümle ile doldurun.)_
            
            Örnek: "Bu proje, kullanıcılarımızın mobil cihazlar üzerinden sipariş verebilmesini sağlayan modern ve hızlı bir API servisi geliştirmeyi amaçlamaktadır."
            
            ### 🔑 Ana Hedefler
            *   _(Projenin başarılı sayılması için gereken ölçülebilir bir hedef, örn: Sipariş sürecini 3 saniyenin altına indirmek.)_
            *   _(Başka bir hedef, örn: %99.9 çalışma süresi (uptime) sağlamak.)_
            *   _(Başka bir hedef...)_
            
            ### scope Kapsam
            _(Projenin neleri içerdiğini ve neleri **içermediğini** burada belirtin.)_
            
            ### 👤 Proje Lideri
            Bu projenin teknik ve idari liderliğinden **@egeren** sorumludur.
            
            ### 🔗 İlgili Bağlantılar
            *   **[Takım Bilgileri](TEAM.md):** Proje ekibi ve rolleri.
            *   **Proje Panosu:** _(Varsa GitHub Projects panosunun linkini buraya ekleyin)_
            
            ---
            <p align="right"><i>Bu belge Terraform tarafından otomatik olarak oluşturulmuştur.</i></p>
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            This document defines the overall goals, scope, and leadership for the **project-gamma** project, to which this repository belongs.
            
            ---
            
            ### 🎯 Project Mission
            _(Please fill this section with one or two sentences describing the core problem this project solves or the main goal it aims to achieve.)_
            
            Example: "This project aims to develop a modern and fast API service that allows our users to place orders via their mobile devices."
            
            ### 🔑 Key Objectives
            *   _(A measurable goal for project success, e.g., Reduce the order processing time to under 3 seconds.)_
            *   _(Another objective, e.g., Achieve 99.9% uptime.)_
            *   _(Another objective...)_
            
            ### 🗺️ Scope
            _(Define what is included and what is **not** included in the project's scope here.)_
            
            ### 👤 Project Lead
            **@egeren** is responsible for the technical and administrative leadership of this project.
            
            ### 🔗 Related Links
            *   **[Team Information](TEAM.md):** The project team and their roles.
            *   **Project Board:** _(Add the link to the GitHub Projects board here, if any)_
            
            ---
            <p align="right"><i>This document was automatically generated by Terraform.</i></p>
            
            </details>
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["to-do-api"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Projesi Tanıtım Belgesi
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu belge, bu reponun ait olduğu **project-alpha** projesinin genel hedeflerini, kapsamını ve liderliğini tanımlar.
            
            ---
            
            ### 🎯 Projenin Amacı
            _(Lütfen bu bölümü, projenin çözdüğü temel sorunu veya ulaşmayı hedeflediği ana amacı bir-iki cümle ile doldurun.)_
            
            Örnek: "Bu proje, kullanıcılarımızın mobil cihazlar üzerinden sipariş verebilmesini sağlayan modern ve hızlı bir API servisi geliştirmeyi amaçlamaktadır."
            
            ### 🔑 Ana Hedefler
            *   _(Projenin başarılı sayılması için gereken ölçülebilir bir hedef, örn: Sipariş sürecini 3 saniyenin altına indirmek.)_
            *   _(Başka bir hedef, örn: %99.9 çalışma süresi (uptime) sağlamak.)_
            *   _(Başka bir hedef...)_
            
            ### scope Kapsam
            _(Projenin neleri içerdiğini ve neleri **içermediğini** burada belirtin.)_
            
            ### 👤 Proje Lideri
            Bu projenin teknik ve idari liderliğinden **@flovearth** sorumludur.
            
            ### 🔗 İlgili Bağlantılar
            *   **[Takım Bilgileri](TEAM.md):** Proje ekibi ve rolleri.
            *   **Proje Panosu:** _(Varsa GitHub Projects panosunun linkini buraya ekleyin)_
            
            ---
            <p align="right"><i>Bu belge Terraform tarafından otomatik olarak oluşturulmuştur.</i></p>
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            This document defines the overall goals, scope, and leadership for the **project-alpha** project, to which this repository belongs.
            
            ---
            
            ### 🎯 Project Mission
            _(Please fill this section with one or two sentences describing the core problem this project solves or the main goal it aims to achieve.)_
            
            Example: "This project aims to develop a modern and fast API service that allows our users to place orders via their mobile devices."
            
            ### 🔑 Key Objectives
            *   _(A measurable goal for project success, e.g., Reduce the order processing time to under 3 seconds.)_
            *   _(Another objective, e.g., Achieve 99.9% uptime.)_
            *   _(Another objective...)_
            
            ### 🗺️ Scope
            _(Define what is included and what is **not** included in the project's scope here.)_
            
            ### 👤 Project Lead
            **@flovearth** is responsible for the technical and administrative leadership of this project.
            
            ### 🔗 Related Links
            *   **[Team Information](TEAM.md):** The project team and their roles.
            *   **Project Board:** _(Add the link to the GitHub Projects board here, if any)_
            
            ---
            <p align="right"><i>This document was automatically generated by Terraform.</i></p>
            
            </details>
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_project["to-do-web"] will be created
  + resource "github_repository_file" "docs_project" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add project documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Projesi Tanıtım Belgesi
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu belge, bu reponun ait olduğu **project-alpha** projesinin genel hedeflerini, kapsamını ve liderliğini tanımlar.
            
            ---
            
            ### 🎯 Projenin Amacı
            _(Lütfen bu bölümü, projenin çözdüğü temel sorunu veya ulaşmayı hedeflediği ana amacı bir-iki cümle ile doldurun.)_
            
            Örnek: "Bu proje, kullanıcılarımızın mobil cihazlar üzerinden sipariş verebilmesini sağlayan modern ve hızlı bir API servisi geliştirmeyi amaçlamaktadır."
            
            ### 🔑 Ana Hedefler
            *   _(Projenin başarılı sayılması için gereken ölçülebilir bir hedef, örn: Sipariş sürecini 3 saniyenin altına indirmek.)_
            *   _(Başka bir hedef, örn: %99.9 çalışma süresi (uptime) sağlamak.)_
            *   _(Başka bir hedef...)_
            
            ### scope Kapsam
            _(Projenin neleri içerdiğini ve neleri **içermediğini** burada belirtin.)_
            
            ### 👤 Proje Lideri
            Bu projenin teknik ve idari liderliğinden **@flovearth** sorumludur.
            
            ### 🔗 İlgili Bağlantılar
            *   **[Takım Bilgileri](TEAM.md):** Proje ekibi ve rolleri.
            *   **Proje Panosu:** _(Varsa GitHub Projects panosunun linkini buraya ekleyin)_
            
            ---
            <p align="right"><i>Bu belge Terraform tarafından otomatik olarak oluşturulmuştur.</i></p>
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            This document defines the overall goals, scope, and leadership for the **project-alpha** project, to which this repository belongs.
            
            ---
            
            ### 🎯 Project Mission
            _(Please fill this section with one or two sentences describing the core problem this project solves or the main goal it aims to achieve.)_
            
            Example: "This project aims to develop a modern and fast API service that allows our users to place orders via their mobile devices."
            
            ### 🔑 Key Objectives
            *   _(A measurable goal for project success, e.g., Reduce the order processing time to under 3 seconds.)_
            *   _(Another objective, e.g., Achieve 99.9% uptime.)_
            *   _(Another objective...)_
            
            ### 🗺️ Scope
            _(Define what is included and what is **not** included in the project's scope here.)_
            
            ### 👤 Project Lead
            **@flovearth** is responsible for the technical and administrative leadership of this project.
            
            ### 🔗 Related Links
            *   **[Team Information](TEAM.md):** The project team and their roles.
            *   **Project Board:** _(Add the link to the GitHub Projects board here, if any)_
            
            ---
            <p align="right"><i>This document was automatically generated by Terraform.</i></p>
            
            </details>
        EOT
      + file                         = "docs/PROJECT.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["01-Documentation"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Documentation Takımı ve Rolleri
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu projedeki güncel ekip üyelerini ve rollerini görmek için lütfen GitHub'ın kendi takım sayfasını ziyaret edin. Oradaki liste **her zaman günceldir**.
            
            ### ➡️ [Güncel Takım Listesi İçin Tıkla](https://github.com/orgs/{{GITHUB_ORG}}/teams/Documentation)
            
            ---
            
            Bu dokümanın amacı ise projedeki rolleri ve sorumlulukları tanımlamaktır.
            
            ### 📜 Rol Tanımları
            
            #### Proje Lideri (Project Lead)
            *   Projenin genel vizyonundan ve teknik yönünden sorumludur.
            *   Nihai teknik kararları verir ve mimariyi yönlendirir.
            *   Takım koordinasyonunu sağlar ve `pull request`'lerde son onay merciidir.
            
            #### Takım Sorumlusu (Maintainer)
            *   Proje liderine teknik konularda yardımcı olur.
            *   Kod kalitesini denetler, `pull request`'leri inceler ve onaylar.
            *   Yeni katılan üyelere mentorluk yapar.
            
            #### Üye (Member)
            *   Projenin gelişimine aktif olarak kod yazarak, dokümantasyon hazırlayarak veya issue'ları çözerek katkıda bulunur.
            *   `Pull request` açar ve diğer üyelerin kodlarını inceler.
            *   Projenin standartlarına ve geliştirme akışına uyar.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            To see the current members and roles of this project, please visit the official GitHub Team page. The list there is **always up-to-date**.
            
            ### ➡️ [Click Here for the Current Team List](https://github.com/orgs/{{GITHUB_ORG}}/teams/Documentation)
            
            ---
            
            The purpose of this document is to define the roles and responsibilities within the project.
            
            ### 📜 Role Definitions
            
            #### Project Lead
            *   Responsible for the overall vision and technical direction of the project.
            *   Makes final technical decisions and guides the architecture.
            *   Ensures team coordination and is the final approver on pull requests.
            
            #### Maintainer
            *   Assists the Project Lead in technical matters.
            *   Monitors code quality, reviews and approves pull requests.
            *   Mentors new members.
            
            #### Member
            *   Actively contributes to the project by writing code, creating documentation, or resolving issues.
            *   Opens pull requests and reviews code from other members.
            *   Adheres to the project's standards and development workflow.
            
            </details>
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["communication-service"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-beta Takımı ve Rolleri
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu projedeki güncel ekip üyelerini ve rollerini görmek için lütfen GitHub'ın kendi takım sayfasını ziyaret edin. Oradaki liste **her zaman günceldir**.
            
            ### ➡️ [Güncel Takım Listesi İçin Tıkla](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-beta)
            
            ---
            
            Bu dokümanın amacı ise projedeki rolleri ve sorumlulukları tanımlamaktır.
            
            ### 📜 Rol Tanımları
            
            #### Proje Lideri (Project Lead)
            *   Projenin genel vizyonundan ve teknik yönünden sorumludur.
            *   Nihai teknik kararları verir ve mimariyi yönlendirir.
            *   Takım koordinasyonunu sağlar ve `pull request`'lerde son onay merciidir.
            
            #### Takım Sorumlusu (Maintainer)
            *   Proje liderine teknik konularda yardımcı olur.
            *   Kod kalitesini denetler, `pull request`'leri inceler ve onaylar.
            *   Yeni katılan üyelere mentorluk yapar.
            
            #### Üye (Member)
            *   Projenin gelişimine aktif olarak kod yazarak, dokümantasyon hazırlayarak veya issue'ları çözerek katkıda bulunur.
            *   `Pull request` açar ve diğer üyelerin kodlarını inceler.
            *   Projenin standartlarına ve geliştirme akışına uyar.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            To see the current members and roles of this project, please visit the official GitHub Team page. The list there is **always up-to-date**.
            
            ### ➡️ [Click Here for the Current Team List](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-beta)
            
            ---
            
            The purpose of this document is to define the roles and responsibilities within the project.
            
            ### 📜 Role Definitions
            
            #### Project Lead
            *   Responsible for the overall vision and technical direction of the project.
            *   Makes final technical decisions and guides the architecture.
            *   Ensures team coordination and is the final approver on pull requests.
            
            #### Maintainer
            *   Assists the Project Lead in technical matters.
            *   Monitors code quality, reviews and approves pull requests.
            *   Mentors new members.
            
            #### Member
            *   Actively contributes to the project by writing code, creating documentation, or resolving issues.
            *   Opens pull requests and reviews code from other members.
            *   Adheres to the project's standards and development workflow.
            
            </details>
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["general-docs"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-gamma Takımı ve Rolleri
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu projedeki güncel ekip üyelerini ve rollerini görmek için lütfen GitHub'ın kendi takım sayfasını ziyaret edin. Oradaki liste **her zaman günceldir**.
            
            ### ➡️ [Güncel Takım Listesi İçin Tıkla](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-gamma)
            
            ---
            
            Bu dokümanın amacı ise projedeki rolleri ve sorumlulukları tanımlamaktır.
            
            ### 📜 Rol Tanımları
            
            #### Proje Lideri (Project Lead)
            *   Projenin genel vizyonundan ve teknik yönünden sorumludur.
            *   Nihai teknik kararları verir ve mimariyi yönlendirir.
            *   Takım koordinasyonunu sağlar ve `pull request`'lerde son onay merciidir.
            
            #### Takım Sorumlusu (Maintainer)
            *   Proje liderine teknik konularda yardımcı olur.
            *   Kod kalitesini denetler, `pull request`'leri inceler ve onaylar.
            *   Yeni katılan üyelere mentorluk yapar.
            
            #### Üye (Member)
            *   Projenin gelişimine aktif olarak kod yazarak, dokümantasyon hazırlayarak veya issue'ları çözerek katkıda bulunur.
            *   `Pull request` açar ve diğer üyelerin kodlarını inceler.
            *   Projenin standartlarına ve geliştirme akışına uyar.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            To see the current members and roles of this project, please visit the official GitHub Team page. The list there is **always up-to-date**.
            
            ### ➡️ [Click Here for the Current Team List](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-gamma)
            
            ---
            
            The purpose of this document is to define the roles and responsibilities within the project.
            
            ### 📜 Role Definitions
            
            #### Project Lead
            *   Responsible for the overall vision and technical direction of the project.
            *   Makes final technical decisions and guides the architecture.
            *   Ensures team coordination and is the final approver on pull requests.
            
            #### Maintainer
            *   Assists the Project Lead in technical matters.
            *   Monitors code quality, reviews and approves pull requests.
            *   Mentors new members.
            
            #### Member
            *   Actively contributes to the project by writing code, creating documentation, or resolving issues.
            *   Opens pull requests and reviews code from other members.
            *   Adheres to the project's standards and development workflow.
            
            </details>
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["to-do-api"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Takımı ve Rolleri
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu projedeki güncel ekip üyelerini ve rollerini görmek için lütfen GitHub'ın kendi takım sayfasını ziyaret edin. Oradaki liste **her zaman günceldir**.
            
            ### ➡️ [Güncel Takım Listesi İçin Tıkla](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-alpha)
            
            ---
            
            Bu dokümanın amacı ise projedeki rolleri ve sorumlulukları tanımlamaktır.
            
            ### 📜 Rol Tanımları
            
            #### Proje Lideri (Project Lead)
            *   Projenin genel vizyonundan ve teknik yönünden sorumludur.
            *   Nihai teknik kararları verir ve mimariyi yönlendirir.
            *   Takım koordinasyonunu sağlar ve `pull request`'lerde son onay merciidir.
            
            #### Takım Sorumlusu (Maintainer)
            *   Proje liderine teknik konularda yardımcı olur.
            *   Kod kalitesini denetler, `pull request`'leri inceler ve onaylar.
            *   Yeni katılan üyelere mentorluk yapar.
            
            #### Üye (Member)
            *   Projenin gelişimine aktif olarak kod yazarak, dokümantasyon hazırlayarak veya issue'ları çözerek katkıda bulunur.
            *   `Pull request` açar ve diğer üyelerin kodlarını inceler.
            *   Projenin standartlarına ve geliştirme akışına uyar.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            To see the current members and roles of this project, please visit the official GitHub Team page. The list there is **always up-to-date**.
            
            ### ➡️ [Click Here for the Current Team List](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-alpha)
            
            ---
            
            The purpose of this document is to define the roles and responsibilities within the project.
            
            ### 📜 Role Definitions
            
            #### Project Lead
            *   Responsible for the overall vision and technical direction of the project.
            *   Makes final technical decisions and guides the architecture.
            *   Ensures team coordination and is the final approver on pull requests.
            
            #### Maintainer
            *   Assists the Project Lead in technical matters.
            *   Monitors code quality, reviews and approves pull requests.
            *   Mentors new members.
            
            #### Member
            *   Actively contributes to the project by writing code, creating documentation, or resolving issues.
            *   Opens pull requests and reviews code from other members.
            *   Adheres to the project's standards and development workflow.
            
            </details>
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.docs_team["to-do-web"] will be created
  + resource "github_repository_file" "docs_team" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Add team documentation"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # project-alpha Takımı ve Rolleri
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            Bu projedeki güncel ekip üyelerini ve rollerini görmek için lütfen GitHub'ın kendi takım sayfasını ziyaret edin. Oradaki liste **her zaman günceldir**.
            
            ### ➡️ [Güncel Takım Listesi İçin Tıkla](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-alpha)
            
            ---
            
            Bu dokümanın amacı ise projedeki rolleri ve sorumlulukları tanımlamaktır.
            
            ### 📜 Rol Tanımları
            
            #### Proje Lideri (Project Lead)
            *   Projenin genel vizyonundan ve teknik yönünden sorumludur.
            *   Nihai teknik kararları verir ve mimariyi yönlendirir.
            *   Takım koordinasyonunu sağlar ve `pull request`'lerde son onay merciidir.
            
            #### Takım Sorumlusu (Maintainer)
            *   Proje liderine teknik konularda yardımcı olur.
            *   Kod kalitesini denetler, `pull request`'leri inceler ve onaylar.
            *   Yeni katılan üyelere mentorluk yapar.
            
            #### Üye (Member)
            *   Projenin gelişimine aktif olarak kod yazarak, dokümantasyon hazırlayarak veya issue'ları çözerek katkıda bulunur.
            *   `Pull request` açar ve diğer üyelerin kodlarını inceler.
            *   Projenin standartlarına ve geliştirme akışına uyar.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            To see the current members and roles of this project, please visit the official GitHub Team page. The list there is **always up-to-date**.
            
            ### ➡️ [Click Here for the Current Team List](https://github.com/orgs/{{GITHUB_ORG}}/teams/project-alpha)
            
            ---
            
            The purpose of this document is to define the roles and responsibilities within the project.
            
            ### 📜 Role Definitions
            
            #### Project Lead
            *   Responsible for the overall vision and technical direction of the project.
            *   Makes final technical decisions and guides the architecture.
            *   Ensures team coordination and is the final approver on pull requests.
            
            #### Maintainer
            *   Assists the Project Lead in technical matters.
            *   Monitors code quality, reviews and approves pull requests.
            *   Mentors new members.
            
            #### Member
            *   Actively contributes to the project by writing code, creating documentation, or resolving issues.
            *   Opens pull requests and reviews code from other members.
            *   Adheres to the project's standards and development workflow.
            
            </details>
        EOT
      + file                         = "docs/TEAM.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["01-Documentation"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # 01-Documentation
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            > **ÖNEMLİ:** Bu repodaki kodlar, daha büyük bir proje olan **Documentation** projesinin bir parçasıdır. Projenin genel hedefleri hakkında bilgi için [`docs/PROJECT.md`](docs/PROJECT.md) belgesini inceleyin.
            
            <!-- LÜTFEN BU ALANI DOLDURUN: Bu reponun ne işe yaradığını anlatan bir veya iki cümlelik kısa bir açıklama ekleyin. -->
            
            ---
            
            ### 🛠️ Yerel Geliştirme Ortamı Kurulumu
            
            #### Ön Gereksinimler
            
            <!-- Doldur: Bu projeyi çalıştırmak için geliştiricinin bilgisayarında hangi araçların (örn: Node.js v18+) kurulu olması gerektiğini listeleyin. -->
            *   Aracın Adı `(versiyon)`
            
            #### Kurulum
            
            1.  **Repoyu Klonlayın:**
                ```bash
                git clone https://github.com/BKT-DevOps/01-Documentation.git
                cd 01-Documentation
                ```
            2.  **Bağımlılıkları Yükleyin:**
                <!-- Doldur: Bağımlılıkları kurmak için gereken komutu buraya yazın (Örnek: npm install). -->
                
            3.  **Ortam Değişkenlerini Ayarlayın:**
                <!-- Doldur: Gerekliyse, .env.example dosyasını .env olarak kopyalamalarını söyleyin. -->
            
            #### Uygulamayı Çalıştırma
            <!-- Doldur: Geliştirme sunucusunu başlatan komutu buraya yazın (Örnek: npm run dev). -->
            
            #### Testleri Çalıştırma
            <!-- Doldur: Testleri çalıştıran komutu buraya yazın (Örnek: npm test). -->
            
            ### 🤝 Katkıda Bulunma
            Projeye katkıda bulunmak isterseniz, lütfen [`CONTRIBUTING.md`](CONTRIBUTING.md) dosyasını inceleyin.
            
            ### 📄 Lisans
            Bu proje **MIT Lisansı** ile lisanslanmıştır. Detaylar için [`LICENSE`](LICENSE) dosyasına bakınız.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            > **IMPORTANT:** This repository is part of a larger project: **Documentation**. For project goals, please review the [`docs/PROJECT.md`](docs/PROJECT.md) document.
            
            <!-- PLEASE FILL THIS IN: Add a short, one-sentence description of what this repository does. -->
            
            ---
            
            ### 🛠️ Local Development Setup
            
            #### Prerequisites
            <!-- Fill in: List the tools a developer must have installed (e.g., Node.js v18+). -->
            *   Tool Name `(version)`
            
            #### Installation
            
            1.  **Clone the repository:**
                ```bash
                git clone https://github.com/BKT-DevOps/01-Documentation.git
                cd 01-Documentation
                ```
            2.  **Install dependencies:**
                <!-- Fill in: Provide the command to install dependencies (Example: npm install). -->
                
            3.  **Set up environment variables:**
                <!-- Fill in: If necessary, instruct users to copy .env.example to .env. -->
            
            #### Running the Application
            <!-- Fill in: Provide the command to start the development server (Example: npm run dev). -->
            
            #### Running Tests
            <!-- Fill in: Provide the command to run the tests (Example: npm test). -->
            
            ### 🤝 Contributing
            If you wish to contribute, please review the [`CONTRIBUTING.md`](CONTRIBUTING.md) file.
            
            ### 📄 License
            This project is licensed under the **MIT License**. See the [`LICENSE`](LICENSE) file for details.
            
            </details>
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "01-Documentation"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["communication-service"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # communication-service
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            > **ÖNEMLİ:** Bu repodaki kodlar, daha büyük bir proje olan **project-beta** projesinin bir parçasıdır. Projenin genel hedefleri hakkında bilgi için [`docs/PROJECT.md`](docs/PROJECT.md) belgesini inceleyin.
            
            <!-- LÜTFEN BU ALANI DOLDURUN: Bu reponun ne işe yaradığını anlatan bir veya iki cümlelik kısa bir açıklama ekleyin. -->
            
            ---
            
            ### 🛠️ Yerel Geliştirme Ortamı Kurulumu
            
            #### Ön Gereksinimler
            
            <!-- Doldur: Bu projeyi çalıştırmak için geliştiricinin bilgisayarında hangi araçların (örn: Node.js v18+) kurulu olması gerektiğini listeleyin. -->
            *   Aracın Adı `(versiyon)`
            
            #### Kurulum
            
            1.  **Repoyu Klonlayın:**
                ```bash
                git clone https://github.com/BKT-DevOps/communication-service.git
                cd communication-service
                ```
            2.  **Bağımlılıkları Yükleyin:**
                <!-- Doldur: Bağımlılıkları kurmak için gereken komutu buraya yazın (Örnek: npm install). -->
                
            3.  **Ortam Değişkenlerini Ayarlayın:**
                <!-- Doldur: Gerekliyse, .env.example dosyasını .env olarak kopyalamalarını söyleyin. -->
            
            #### Uygulamayı Çalıştırma
            <!-- Doldur: Geliştirme sunucusunu başlatan komutu buraya yazın (Örnek: npm run dev). -->
            
            #### Testleri Çalıştırma
            <!-- Doldur: Testleri çalıştıran komutu buraya yazın (Örnek: npm test). -->
            
            ### 🤝 Katkıda Bulunma
            Projeye katkıda bulunmak isterseniz, lütfen [`CONTRIBUTING.md`](CONTRIBUTING.md) dosyasını inceleyin.
            
            ### 📄 Lisans
            Bu proje **MIT Lisansı** ile lisanslanmıştır. Detaylar için [`LICENSE`](LICENSE) dosyasına bakınız.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            > **IMPORTANT:** This repository is part of a larger project: **project-beta**. For project goals, please review the [`docs/PROJECT.md`](docs/PROJECT.md) document.
            
            <!-- PLEASE FILL THIS IN: Add a short, one-sentence description of what this repository does. -->
            
            ---
            
            ### 🛠️ Local Development Setup
            
            #### Prerequisites
            <!-- Fill in: List the tools a developer must have installed (e.g., Node.js v18+). -->
            *   Tool Name `(version)`
            
            #### Installation
            
            1.  **Clone the repository:**
                ```bash
                git clone https://github.com/BKT-DevOps/communication-service.git
                cd communication-service
                ```
            2.  **Install dependencies:**
                <!-- Fill in: Provide the command to install dependencies (Example: npm install). -->
                
            3.  **Set up environment variables:**
                <!-- Fill in: If necessary, instruct users to copy .env.example to .env. -->
            
            #### Running the Application
            <!-- Fill in: Provide the command to start the development server (Example: npm run dev). -->
            
            #### Running Tests
            <!-- Fill in: Provide the command to run the tests (Example: npm test). -->
            
            ### 🤝 Contributing
            If you wish to contribute, please review the [`CONTRIBUTING.md`](CONTRIBUTING.md) file.
            
            ### 📄 License
            This project is licensed under the **MIT License**. See the [`LICENSE`](LICENSE) file for details.
            
            </details>
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "communication-service"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["general-docs"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # general-docs
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            > **ÖNEMLİ:** Bu repodaki kodlar, daha büyük bir proje olan **project-gamma** projesinin bir parçasıdır. Projenin genel hedefleri hakkında bilgi için [`docs/PROJECT.md`](docs/PROJECT.md) belgesini inceleyin.
            
            <!-- LÜTFEN BU ALANI DOLDURUN: Bu reponun ne işe yaradığını anlatan bir veya iki cümlelik kısa bir açıklama ekleyin. -->
            
            ---
            
            ### 🛠️ Yerel Geliştirme Ortamı Kurulumu
            
            #### Ön Gereksinimler
            
            <!-- Doldur: Bu projeyi çalıştırmak için geliştiricinin bilgisayarında hangi araçların (örn: Node.js v18+) kurulu olması gerektiğini listeleyin. -->
            *   Aracın Adı `(versiyon)`
            
            #### Kurulum
            
            1.  **Repoyu Klonlayın:**
                ```bash
                git clone https://github.com/BKT-DevOps/general-docs.git
                cd general-docs
                ```
            2.  **Bağımlılıkları Yükleyin:**
                <!-- Doldur: Bağımlılıkları kurmak için gereken komutu buraya yazın (Örnek: npm install). -->
                
            3.  **Ortam Değişkenlerini Ayarlayın:**
                <!-- Doldur: Gerekliyse, .env.example dosyasını .env olarak kopyalamalarını söyleyin. -->
            
            #### Uygulamayı Çalıştırma
            <!-- Doldur: Geliştirme sunucusunu başlatan komutu buraya yazın (Örnek: npm run dev). -->
            
            #### Testleri Çalıştırma
            <!-- Doldur: Testleri çalıştıran komutu buraya yazın (Örnek: npm test). -->
            
            ### 🤝 Katkıda Bulunma
            Projeye katkıda bulunmak isterseniz, lütfen [`CONTRIBUTING.md`](CONTRIBUTING.md) dosyasını inceleyin.
            
            ### 📄 Lisans
            Bu proje **MIT Lisansı** ile lisanslanmıştır. Detaylar için [`LICENSE`](LICENSE) dosyasına bakınız.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            > **IMPORTANT:** This repository is part of a larger project: **project-gamma**. For project goals, please review the [`docs/PROJECT.md`](docs/PROJECT.md) document.
            
            <!-- PLEASE FILL THIS IN: Add a short, one-sentence description of what this repository does. -->
            
            ---
            
            ### 🛠️ Local Development Setup
            
            #### Prerequisites
            <!-- Fill in: List the tools a developer must have installed (e.g., Node.js v18+). -->
            *   Tool Name `(version)`
            
            #### Installation
            
            1.  **Clone the repository:**
                ```bash
                git clone https://github.com/BKT-DevOps/general-docs.git
                cd general-docs
                ```
            2.  **Install dependencies:**
                <!-- Fill in: Provide the command to install dependencies (Example: npm install). -->
                
            3.  **Set up environment variables:**
                <!-- Fill in: If necessary, instruct users to copy .env.example to .env. -->
            
            #### Running the Application
            <!-- Fill in: Provide the command to start the development server (Example: npm run dev). -->
            
            #### Running Tests
            <!-- Fill in: Provide the command to run the tests (Example: npm test). -->
            
            ### 🤝 Contributing
            If you wish to contribute, please review the [`CONTRIBUTING.md`](CONTRIBUTING.md) file.
            
            ### 📄 License
            This project is licensed under the **MIT License**. See the [`LICENSE`](LICENSE) file for details.
            
            </details>
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "general-docs"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["to-do-api"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # to-do-api
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            > **ÖNEMLİ:** Bu repodaki kodlar, daha büyük bir proje olan **project-alpha** projesinin bir parçasıdır. Projenin genel hedefleri hakkında bilgi için [`docs/PROJECT.md`](docs/PROJECT.md) belgesini inceleyin.
            
            <!-- LÜTFEN BU ALANI DOLDURUN: Bu reponun ne işe yaradığını anlatan bir veya iki cümlelik kısa bir açıklama ekleyin. -->
            
            ---
            
            ### 🛠️ Yerel Geliştirme Ortamı Kurulumu
            
            #### Ön Gereksinimler
            
            <!-- Doldur: Bu projeyi çalıştırmak için geliştiricinin bilgisayarında hangi araçların (örn: Node.js v18+) kurulu olması gerektiğini listeleyin. -->
            *   Aracın Adı `(versiyon)`
            
            #### Kurulum
            
            1.  **Repoyu Klonlayın:**
                ```bash
                git clone https://github.com/BKT-DevOps/to-do-api.git
                cd to-do-api
                ```
            2.  **Bağımlılıkları Yükleyin:**
                <!-- Doldur: Bağımlılıkları kurmak için gereken komutu buraya yazın (Örnek: npm install). -->
                
            3.  **Ortam Değişkenlerini Ayarlayın:**
                <!-- Doldur: Gerekliyse, .env.example dosyasını .env olarak kopyalamalarını söyleyin. -->
            
            #### Uygulamayı Çalıştırma
            <!-- Doldur: Geliştirme sunucusunu başlatan komutu buraya yazın (Örnek: npm run dev). -->
            
            #### Testleri Çalıştırma
            <!-- Doldur: Testleri çalıştıran komutu buraya yazın (Örnek: npm test). -->
            
            ### 🤝 Katkıda Bulunma
            Projeye katkıda bulunmak isterseniz, lütfen [`CONTRIBUTING.md`](CONTRIBUTING.md) dosyasını inceleyin.
            
            ### 📄 Lisans
            Bu proje **MIT Lisansı** ile lisanslanmıştır. Detaylar için [`LICENSE`](LICENSE) dosyasına bakınız.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            > **IMPORTANT:** This repository is part of a larger project: **project-alpha**. For project goals, please review the [`docs/PROJECT.md`](docs/PROJECT.md) document.
            
            <!-- PLEASE FILL THIS IN: Add a short, one-sentence description of what this repository does. -->
            
            ---
            
            ### 🛠️ Local Development Setup
            
            #### Prerequisites
            <!-- Fill in: List the tools a developer must have installed (e.g., Node.js v18+). -->
            *   Tool Name `(version)`
            
            #### Installation
            
            1.  **Clone the repository:**
                ```bash
                git clone https://github.com/BKT-DevOps/to-do-api.git
                cd to-do-api
                ```
            2.  **Install dependencies:**
                <!-- Fill in: Provide the command to install dependencies (Example: npm install). -->
                
            3.  **Set up environment variables:**
                <!-- Fill in: If necessary, instruct users to copy .env.example to .env. -->
            
            #### Running the Application
            <!-- Fill in: Provide the command to start the development server (Example: npm run dev). -->
            
            #### Running Tests
            <!-- Fill in: Provide the command to run the tests (Example: npm test). -->
            
            ### 🤝 Contributing
            If you wish to contribute, please review the [`CONTRIBUTING.md`](CONTRIBUTING.md) file.
            
            ### 📄 License
            This project is licensed under the **MIT License**. See the [`LICENSE`](LICENSE) file for details.
            
            </details>
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-api"
      + sha                          = (known after apply)
    }

  # github_repository_file.readme["to-do-web"] will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch_source_sha = (known after apply)
      + commit_message               = "Update README with project information"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # to-do-web
            
            <details open>
            <summary><strong>🇹🇷 Türkçe</strong></summary>
            
            <br>
            
            > **ÖNEMLİ:** Bu repodaki kodlar, daha büyük bir proje olan **project-alpha** projesinin bir parçasıdır. Projenin genel hedefleri hakkında bilgi için [`docs/PROJECT.md`](docs/PROJECT.md) belgesini inceleyin.
            
            <!-- LÜTFEN BU ALANI DOLDURUN: Bu reponun ne işe yaradığını anlatan bir veya iki cümlelik kısa bir açıklama ekleyin. -->
            
            ---
            
            ### 🛠️ Yerel Geliştirme Ortamı Kurulumu
            
            #### Ön Gereksinimler
            
            <!-- Doldur: Bu projeyi çalıştırmak için geliştiricinin bilgisayarında hangi araçların (örn: Node.js v18+) kurulu olması gerektiğini listeleyin. -->
            *   Aracın Adı `(versiyon)`
            
            #### Kurulum
            
            1.  **Repoyu Klonlayın:**
                ```bash
                git clone https://github.com/BKT-DevOps/to-do-web.git
                cd to-do-web
                ```
            2.  **Bağımlılıkları Yükleyin:**
                <!-- Doldur: Bağımlılıkları kurmak için gereken komutu buraya yazın (Örnek: npm install). -->
                
            3.  **Ortam Değişkenlerini Ayarlayın:**
                <!-- Doldur: Gerekliyse, .env.example dosyasını .env olarak kopyalamalarını söyleyin. -->
            
            #### Uygulamayı Çalıştırma
            <!-- Doldur: Geliştirme sunucusunu başlatan komutu buraya yazın (Örnek: npm run dev). -->
            
            #### Testleri Çalıştırma
            <!-- Doldur: Testleri çalıştıran komutu buraya yazın (Örnek: npm test). -->
            
            ### 🤝 Katkıda Bulunma
            Projeye katkıda bulunmak isterseniz, lütfen [`CONTRIBUTING.md`](CONTRIBUTING.md) dosyasını inceleyin.
            
            ### 📄 Lisans
            Bu proje **MIT Lisansı** ile lisanslanmıştır. Detaylar için [`LICENSE`](LICENSE) dosyasına bakınız.
            
            </details>
            
            <details>
            <summary><strong>🇬🇧 English</strong></summary>
            
            <br>
            
            > **IMPORTANT:** This repository is part of a larger project: **project-alpha**. For project goals, please review the [`docs/PROJECT.md`](docs/PROJECT.md) document.
            
            <!-- PLEASE FILL THIS IN: Add a short, one-sentence description of what this repository does. -->
            
            ---
            
            ### 🛠️ Local Development Setup
            
            #### Prerequisites
            <!-- Fill in: List the tools a developer must have installed (e.g., Node.js v18+). -->
            *   Tool Name `(version)`
            
            #### Installation
            
            1.  **Clone the repository:**
                ```bash
                git clone https://github.com/BKT-DevOps/to-do-web.git
                cd to-do-web
                ```
            2.  **Install dependencies:**
                <!-- Fill in: Provide the command to install dependencies (Example: npm install). -->
                
            3.  **Set up environment variables:**
                <!-- Fill in: If necessary, instruct users to copy .env.example to .env. -->
            
            #### Running the Application
            <!-- Fill in: Provide the command to start the development server (Example: npm run dev). -->
            
            #### Running Tests
            <!-- Fill in: Provide the command to run the tests (Example: npm test). -->
            
            ### 🤝 Contributing
            If you wish to contribute, please review the [`CONTRIBUTING.md`](CONTRIBUTING.md) file.
            
            ### 📄 License
            This project is licensed under the **MIT License**. See the [`LICENSE`](LICENSE) file for details.
            
            </details>
        EOT
      + file                         = "README.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "to-do-web"
      + sha                          = (known after apply)
    }

  # github_team.project["Documentation"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "Documentation projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Documentation"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-alpha"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-alpha projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-alpha"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-beta"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-beta projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-beta"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.project["project-gamma"] will be created
  + resource "github_team" "project" {
      + create_default_maintainer = false
      + description               = "project-gamma projesi geliştirme ekibi"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "project-gamma"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.members["Documentation-UsainSasal"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "UsainSasal"
    }

  # github_team_membership.members["Documentation-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["Documentation-flovearth"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "flovearth"
    }

  # github_team_membership.members["Documentation-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["Documentation-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["Documentation-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["Documentation-onurceylan"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "onurceylan"
    }

  # github_team_membership.members["project-alpha-flovearth"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "flovearth"
    }

  # github_team_membership.members["project-alpha-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["project-alpha-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["project-alpha-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["project-beta-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["project-beta-hulyaoner"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hulyaoner"
    }

  # github_team_membership.members["project-beta-ismailaricioglu"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "ismailaricioglu"
    }

  # github_team_membership.members["project-beta-lerkush"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "lerkush"
    }

  # github_team_membership.members["project-gamma-UsainSasal"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "UsainSasal"
    }

  # github_team_membership.members["project-gamma-egeren"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "egeren"
    }

  # github_team_membership.members["project-gamma-onurceylan"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "onurceylan"
    }

  # github_team_repository.access["01-Documentation"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "01-Documentation"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["communication-service"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "communication-service"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["general-docs"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "triage"
      + repository = "general-docs"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["to-do-api"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "to-do-api"
      + team_id    = (known after apply)
    }

  # github_team_repository.access["to-do-web"] will be created
  + resource "github_team_repository" "access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "to-do-web"
      + team_id    = (known after apply)
    }

Plan: 86 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + documentation_pages = {
      + Documentation = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-alpha = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-beta  = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
      + project-gamma = {
          + project_doc = (known after apply)
          + repository  = (known after apply)
          + team_doc    = (known after apply)
        }
    }
  + initial_issues      = {
      + Documentation = {
          + assignees = [
              + "flovearth",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-alpha = {
          + assignees = [
              + "flovearth",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-beta  = {
          + assignees = [
              + "ismailaricioglu",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
      + project-gamma = {
          + assignees = [
              + "egeren",
            ]
          + number    = (known after apply)
          + title     = "Initial Setup"
          + url       = (known after apply)
        }
    }
  + project_summary     = {
      + projects           = {
          + Documentation = {
              + lead         = "flovearth"
              + main_repo    = "01-Documentation"
              + members      = 7
              + repositories = 1
            }
          + project-alpha = {
              + lead         = "flovearth"
              + main_repo    = "to-do-api"
              + members      = 4
              + repositories = 2
            }
          + project-beta  = {
              + lead         = "ismailaricioglu"
              + main_repo    = "communication-service"
              + members      = 4
              + repositories = 1
            }
          + project-gamma = {
              + lead         = "egeren"
              + main_repo    = "general-docs"
              + members      = 3
              + repositories = 1
            }
        }
      + total_memberships  = 18
      + total_projects     = 4
      + total_repositories = 5
    }
  + repositories        = {
      + "01-Documentation"    = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "01-Documentation"
          + ssh_clone_url = (known after apply)
        }
      + communication-service = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "communication-service"
          + ssh_clone_url = (known after apply)
        }
      + general-docs          = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "general-docs"
          + ssh_clone_url = (known after apply)
        }
      + to-do-api             = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "to-do-api"
          + ssh_clone_url = (known after apply)
        }
      + to-do-web             = {
          + clone_url     = (known after apply)
          + full_name     = (known after apply)
          + html_url      = (known after apply)
          + name          = "to-do-web"
          + ssh_clone_url = (known after apply)
        }
    }
  + team_memberships    = {
      + Documentation = {
          + lead         = "flovearth"
          + members      = [
              + "flovearth",
              + "ismailaricioglu",
              + "onurceylan",
              + "UsainSasal",
              + "egeren",
              + "hulyaoner",
              + "lerkush",
            ]
          + repositories = [
              + "01-Documentation",
            ]
        }
      + project-alpha = {
          + lead         = "flovearth"
          + members      = [
              + "ismailaricioglu",
              + "hulyaoner",
              + "lerkush",
              + "flovearth",
            ]
          + repositories = [
              + "to-do-api",
              + "to-do-web",
            ]
        }
      + project-beta  = {
          + lead         = "ismailaricioglu"
          + members      = [
              + "lerkush",
              + "ismailaricioglu",
              + "hulyaoner",
              + "egeren",
            ]
          + repositories = [
              + "communication-service",
            ]
        }
      + project-gamma = {
          + lead         = "egeren"
          + members      = [
              + "egeren",
              + "UsainSasal",
              + "onurceylan",
            ]
          + repositories = [
              + "general-docs",
            ]
        }
    }
  + teams               = {
      + Documentation = {
          + id   = (known after apply)
          + name = "Documentation"
          + slug = (known after apply)
        }
      + project-alpha = {
          + id   = (known after apply)
          + name = "project-alpha"
          + slug = (known after apply)
        }
      + project-beta  = {
          + id   = (known after apply)
          + name = "project-beta"
          + slug = (known after apply)
        }
      + project-gamma = {
          + id   = (known after apply)
          + name = "project-gamma"
          + slug = (known after apply)
        }
    }
  + wiki_pages          = {
      + Documentation = {
          + repository = "01-Documentation"
          + url        = "https://github.com/BKT-DevOps/01-Documentation/wiki"
        }
      + project-alpha = {
          + repository = "to-do-api"
          + url        = "https://github.com/BKT-DevOps/to-do-api/wiki"
        }
      + project-beta  = {
          + repository = "communication-service"
          + url        = "https://github.com/BKT-DevOps/communication-service/wiki"
        }
      + project-gamma = {
          + repository = "general-docs"
          + url        = "https://github.com/BKT-DevOps/general-docs/wiki"
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @slymanmrcan, Action: `pull_request`*